БПКР/src/InformationRegisters/ДанныеПервичныхДокументов/ДанныеПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПервичныхДокументов</name>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НомерРегистратора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.НачисленияПодоходногоНалогаПрочихФизЛиц</types>
      <types>DocumentRef.КорректировкаСтоимостиДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КорректировкаСтоимостиПоступления</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.Доверенность</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.АктСверкиВзаиморасчетов</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОбщийСчетФактураВыписанный</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ГТДПоИмпорту</types>
      <types>DocumentRef.РозничнаяПродажа</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.СчетФактураВыписанный</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДС</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.БольничныйЛист</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.НачислениеЗарплаты</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.ДвижениеМБП</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>DocumentRef.ЗакрытиеЗаказовНаПроизводство</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.КорректировкаСтоимостиРеализации</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ДополнительныеРасходы</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ВводНачальныхОстатков</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/CommonModules/ОбщегоНазначенияБПСобытия/Module.bsl
Функция КорректныйПериодВводаДокументов() Экспорт
	
	// Контролируем ошибку на один разряд. Например, 0017 вместо 2017; 2071 вместо 2017.
	// Допустимым считаем ввод документов на 9 лет в будущем. Например, в 2020 году разрешаем
	// вводить даты в интервале с января 2000 по декабрь 2029.
	
	КонецКорректногоПериода = ДобавитьМесяц(КонецГода(ТекущаяДатаСеанса()), 9 * 12);
	
	КорректныйПериод = Новый Структура;
	КорректныйПериод.Вставить("НачалоКорректногоПериода", Дата(2000, 01, 01));
	КорректныйПериод.Вставить("КонецКорректногоПериода",  КонецКорректногоПериода);
	Возврат КорректныйПериод;
	
КонецФункции

// РЕГИСТРАЦИЯ РЕКВИЗИТОВ ДОКУМЕНТОВ ПОСТУПЛЕНИЯ И ОПЛАТЫ

// Обработчик подписки на событие ПриЗаписиДокументаРегистрацияДанныхПервичныхДокументовИП
Процедура ПриЗаписиДокументаРегистрацияДанныхПервичныхДокументов(Источник, Отказ) Экспорт
	Перем НомерДокумента, ДатаДокумента;
	
	Если Источник.ОбменДанными.Загрузка
		Или (Источник.ДополнительныеСвойства.Свойство("РегистрироватьДанныеПервичныхДокументов")
		И Источник.ДополнительныеСвойства.РегистрироватьДанныеПервичныхДокументов = Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	// При групповом перепроведении реквизиты документов не меняются,
	// поэтому обновление связанных данных выполнять не требуется.
	Если ПроведениеСервер.ГрупповоеПерепроведение(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка = Источник.Ссылка;
	ТипДокумента = ТипЗнч(Ссылка);
	
	ИменаРеквизитов = "Организация, Номер, Дата, СуммаДокумента, ВалютаДокумента";
	
	МетаданныеДокумента = Источник.Метаданные();

	Если НЕ МетаданныеДокумента.Реквизиты.Найти("НомерВходящегоДокумента") = Неопределено Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", НомерВходящегоДокумента";
		Если НЕ МетаданныеДокумента.Реквизиты.Найти("ДатаВходящегоДокумента") = Неопределено Тогда
			ИменаРеквизитов = ИменаРеквизитов + ", ДатаВходящегоДокумента";
		КонецЕсли;
	КонецЕсли;
	
	Если ТипДокумента = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", ИнвентаризацияТоваровНаСкладе";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", ВидОперации";
	КонецЕсли;
	
	Реквизиты = Новый Структура(ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(Реквизиты, Источник);
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	// Установка управляемой блокировки
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДанныеПервичныхДокументов");
	ЭлементБлокировки.УстановитьЗначение("Документ", Ссылка);
	Блокировка.Заблокировать();
	
	НомерДокумента = "";
	ДатаДокумента  = '00010101';
	
	Если ТипДокумента = Тип("ДокументСсылка.ОприходованиеТоваров")
		И ЗначениеЗаполнено(Реквизиты.ИнвентаризацияТоваровНаСкладе) Тогда
		
		РеквизитыИнвентаризации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Реквизиты.ИнвентаризацияТоваровНаСкладе, "Номер, Дата");
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыИнвентаризации.Номер, Истина, Ложь);
		ДатаДокумента  = РеквизитыИнвентаризации.Дата;
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Истина, Ложь);
		ДатаДокумента  = Реквизиты.Дата;
		
	ИначеЕсли Реквизиты.Свойство("НомерВходящегоДокумента") Тогда
		
		НомерДокумента = СокрЛП(Реквизиты.НомерВходящегоДокумента);
		
		Если Реквизиты.Свойство("ДатаВходящегоДокумента") Тогда
			ДатаДокумента = Реквизиты.ДатаВходящегоДокумента;
		Иначе
			ДатаДокумента = Реквизиты.Дата;
		КонецЕсли;
		
	Иначе
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Истина, Ложь);
		ДатаДокумента  = Реквизиты.Дата;
		
	КонецЕсли;
	
	НаборЗаписейРегистра = РегистрыСведений.ДанныеПервичныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.Документ.Установить(Ссылка);
	
	МенеджерЗаписиРегистра = НаборЗаписейРегистра.Добавить();
	МенеджерЗаписиРегистра.Организация       = Реквизиты.Организация;
	МенеджерЗаписиРегистра.Документ          = Ссылка;
	МенеджерЗаписиРегистра.Номер             = НомерДокумента;
	МенеджерЗаписиРегистра.Дата              = ДатаДокумента;
	МенеджерЗаписиРегистра.НомерРегистратора = Реквизиты.Номер;
	МенеджерЗаписиРегистра.ДатаРегистратора  = Реквизиты.Дата;
	МенеджерЗаписиРегистра.СуммаДокумента  = Реквизиты.СуммаДокумента;
	МенеджерЗаписиРегистра.ВалютаДокумента  = Реквизиты.ВалютаДокумента;
	
	// Запись данных первичного документа разрешена всем пользователям,
	// которые вправе изменять этот документ.
	ВыполнитьПроверкуПравДоступа("Изменение", Ссылка.Метаданные());
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписейРегистра.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
